Revit 2026 API

# ColorFillSchemeTitle Property

---

Represents the title displayed in ColorFillLegend.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Title { get; set; }
```
```vb
Public Property Title As String
	Get
	Set
```
```cpp
public:
property String^ Title {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Title : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ColorFillScheme Class

Autodesk.Revit.DB Namespace